Algebraic Matrix CLI v1.0
Available commands:
  - create
  - load
  - help
  - exit
> Matrix 'vec' created:
  Dimensions: 3 x 1
Available commands:
  - create
  - delete
  - assign
  - scalar_multiply
  - transpose
  - rank
  - det
  - inverse
  - 3d_rotate
  - list
  - show
  - save
  - load
  - help
  - exit
> Assign value for element in (0, 0)
> Assign value for element in (1, 0)
> Assign value for element in (2, 0)
> Available commands:
  - create
  - delete
  - assign
  - scalar_multiply
  - transpose
  - rank
  - det
  - inverse
  - 3d_rotate
  - list
  - show
  - save
  - load
  - help
  - exit
> Available commands:
  - create
  - delete
  - assign
  - scalar_multiply
  - transpose
  - rank
  - det
  - inverse
  - 3d_rotate
  - list
  - show
  - save
  - load
  - help
  - exit
> Matrix 'vec':
|  0.000|
|  0.000|
| -1.000|

Available commands:
  - create
  - delete
  - assign
  - scalar_multiply
  - transpose
  - rank
  - det
  - inverse
  - 3d_rotate
  - list
  - show
  - save
  - load
  - help
  - exit
> Assign value for element in (0, 0)
> Assign value for element in (1, 0)
> Assign value for element in (2, 0)
> Available commands:
  - create
  - delete
  - assign
  - scalar_multiply
  - transpose
  - rank
  - det
  - inverse
  - 3d_rotate
  - list
  - show
  - save
  - load
  - help
  - exit
> Available commands:
  - create
  - delete
  - assign
  - scalar_multiply
  - transpose
  - rank
  - det
  - inverse
  - 3d_rotate
  - list
  - show
  - save
  - load
  - help
  - exit
> Matrix 'vec':
|  2.561|
|  4.435|
|  0.879|

Available commands:
  - create
  - delete
  - assign
  - scalar_multiply
  - transpose
  - rank
  - det
  - inverse
  - 3d_rotate
  - list
  - show
  - save
  - load
  - help
  - exit
> Exiting CLI.
